Revit 2027 API
DefinitionGroups.Create Method
Create a new parameter definition group using the name provided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DefinitionGroup Create(
	string name
)
Public Function Create (
	name As String
) As DefinitionGroup
public:
DefinitionGroup^ Create(
	String^ name
)
member Create :
        name : string -> DefinitionGroup
Parameters
name String
The name of the group to be created.
Return Value
DefinitionGroup
If successful a reference to the new parameter group is returned, otherwise null.
Remarks
If a group with the same name already exists then an exception will be thrown.
See Also
Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace